%MCU

%% Q1 - 1

C{1} = [1 1 2 2]; C{2} = [2 1 1 1]; C{3} = [3,2,3,4]; C{4} = [2,1,2,0]; C{5} = [2,3,1,1];C{6} = [3,1,1,1];C{7} = [3,5,1,1];

solutions.Noah_Test_Q1_1(C)

C{1} = [5 1 2 2]; C{2} = [2 2 1 7]; C{3} = [2,2,3,4]; C{4} = [1,1,2,0]; C{5} = [2,3,2,1];C{6} = [9,1,1,1];C{7} = [5,5,1,1];

solutions.Noah_Test_Q1_1(C)

%% Q1 - 2

%我的理解是这道题不能重新组合矩阵元素，就是顺序是固定的，如果可以的话那这个例子输出就不是1了，所以我会按这个思路做，类似卷积层的correlation的移动

matrix = [1,1,2,1;2,1,3,2;3,1,0,1;3,1,2,1];

target = [1,0;1,1];

solutions.Noah_Test_Q1_2(matrix, target)

matrix = [1,1,2,2,2;2,1,3,2,2;3,1,0,1,2;3,1,2,1,2];

target = [1,0;1,1];

solutions.Noah_Test_Q1_2(matrix, target)
